In [1]:
import pandas as pd

In [2]:
#series

In [4]:
list=[26,97,12,1,2,30]
s1=pd.Series(list)
s1

0    26
1    97
2    12
3     1
4     2
5    30
dtype: int64

In [7]:
list=[26,97,12,1,2,30]
s1=pd.Series(list,index=['a','b','c','d','e','f'])
s1

a    26
b    97
c    12
d     1
e     2
f    30
dtype: int64

In [10]:
tuple=(1,2,3,4,5,6)
list=[26,97,12,1,2,30]
s1=pd.Series(list,index=tuple)
s2=pd.Series(tuple,index=list)
print(s1)
print(s2)

1    26
2    97
3    12
4     1
5     2
6    30
dtype: int64
26    1
97    2
12    3
1     4
2     5
30    6
dtype: int64

In [12]:
d={'a':1,'b':2,'c':3,'d':4}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
tuple=(1,2,3,4,5,6)
list=[26,97,12,1,2,30]
s1=pd.DataFrame(list,index=tuple)
s2=pd.DataFrame(tuple,index=list)
print(s1)
print(s2)

    0
1  26
2  97
3  12
4   1
5   2
6  30
    0
26  1
97  2
12  3
1   4
2   5
30  6

In [15]:
dict = {'name':['priti','rohit','sajita'],
        'marks':[5,0,11],
        'cgpa':[5.5,0.1,8.2]}
df=pd.DataFrame(dict)
df

     name  marks  cgpa
0   priti      5   5.5
1   rohit      0   0.1
2  sajita     11   8.2

In [19]:
import numpy as np
dict = {
        'marks':np.random.randint(1,100,10),
        'cgpa':np.random.randint(1,10,10)}
df=pd.DataFrame(dict)
df

   marks  cgpa
0     73     7
1      4     9
2     58     4
3     81     5
4     77     1
5     43     9
6     32     3
7     76     4
8     77     7
9     41     7

In [27]:
import numpy as np
import pandas as pd
data={'std_id':np.linspace(1,30,30),
      'math_score':np.random.randint(25,100,30),
      'science_score':np.random.randint(25,100,30),
      'english_score':np.random.randint(25,100,30),
      'bio_score':np.random.randint(25,100,30),
      'physics_score':np.random.randint(25,100,30),
      'chemistry_score':np.random.randint(25,100,30)}

In [28]:
df=pd.DataFrame(data)
df

,std_id,math_score,science_score,english_score,bio_score,physics_score,chemistry_score
0,1.0,71,70,89,33,45,67
1,2.0,30,78,99,60,41,53
2,3.0,60,79,91,94,64,28
3,4.0,42,95,46,83,76,92
4,5.0,34,46,69,70,53,70
5,6.0,59,88,93,52,63,29
6,7.0,82,95,49,68,72,82
7,8.0,28,37,88,68,86,94
8,9.0,51,58,67,95,63,60
9,10.0,35,52,85,49,82,71
10,11.0,81,47,73,65,41,70
11,12.0,88,46,78,51,90,39
12,13.0,56,45,97,82,93,30
13,14.0,53,94,77,89,39,59
14,15.0,69,41,56,48,31,41
15,16.0,61,96,67,48,45,99
16,17.0,97,91,36,69,88,92
17,18.0,55,34,52,95,51,95
18,19.0,91,55,82,73,56,59
19,20.0,56,99,97,91,53,41
20,21.0,97,55,46,79,26,71
21,22.0,35,42,75,92,46,89
22,23.0,76,25,57,78,67,90
23,24.0,63,68,57,73,69,49
24,25.0,99,47,98,65,49,92
25,26.0,75,77,62,51,82,99
26,27.0,27,72,40,30,90,88
27,28.0,54,91,49,97,85,66
28,29.0,65,67,41,39,52,80
29,30.0,81,44,92,41,33,75

In [30]:
df.head() #they give top 5 row and column

,std_id,math_score,science_score,english_score,bio_score,physics_score,chemistry_score
0,1.0,71,70,89,33,45,67
1,2.0,30,78,99,60,41,53
2,3.0,60,79,91,94,64,28
3,4.0,42,95,46,83,76,92
4,5.0,34,46,69,70,53,70

In [32]:
df.tail() #they give last 5 column and row

,std_id,math_score,science_score,english_score,bio_score,physics_score,chemistry_score
25,26.0,75,77,62,51,82,99
26,27.0,27,72,40,30,90,88
27,28.0,54,91,49,97,85,66
28,29.0,65,67,41,39,52,80
29,30.0,81,44,92,41,33,75

In [34]:
df.info() # they give information in the table

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   std_id           30 non-null     float64
 1   math_score       30 non-null     int32
 2   science_score    30 non-null     int32
 3   english_score    30 non-null     int32
 4   bio_score        30 non-null     int32
 5   physics_score    30 non-null     int32
 6   chemistry_score  30 non-null     int32
dtypes: float64(1), int32(6)
memory usage: 1.1 KB

In [36]:
df.isnull() #they have useful for finding null value

,std_id,math_score,science_score,english_score,bio_score,physics_score,chemistry_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False
11,False,False,False,False,False,False,False
12,False,False,False,False,False,False,False
13,False,False,False,False,False,False,False
14,False,False,False,False,False,False,False
15,False,False,False,False,False,False,False
16,False,False,False,False,False,False,False
17,False,False,False,False,False,False,False
18,False,False,False,False,False,False,False
19,False,False,False,False,False,False,False
20,False,False,False,False,False,False,False
21,False,False,False,False,False,False,False
22,False,False,False,False,False,False,False
23,False,False,False,False,False,False,False
24,False,False,False,False,False,False,False
25,False,False,False,False,False,False,False
26,False,False,False,False,False,False,False
27,False,False,False,False,False,False,False
28,False,False,False,False,False,False,False
29,False,False,False,False,False,False,False

In [37]:
df.isna().sum()

std_id             0
math_score         0
science_score      0
english_score      0
bio_score          0
physics_score      0
chemistry_score    0
dtype: int64

In [38]:
df.describe()

,std_id,math_score,science_score,english_score,bio_score,physics_score,chemistry_score
count,30.000000,30.000000,30.000000,30.000000,30.000000,30.000000,30.000000
mean,15.500000,62.366667,64.466667,70.266667,67.600000,61.033333,69.000000
std,8.803408,21.501377,22.210177,20.006780,19.938872,19.817240,22.319004
min,1.000000,27.000000,25.000000,36.000000,30.000000,26.000000,28.000000
25%,8.250000,51.500000,46.000000,53.000000,51.000000,45.250000,54.500000
50%,15.500000,60.500000,62.500000,71.000000,68.500000,59.500000,70.500000
75%,22.750000,79.750000,85.750000,88.750000,82.750000,80.500000,89.750000
max,30.000000,99.000000,99.000000,99.000000,97.000000,93.000000,99.000000

In [40]:
from statistics import mean,median,mode

In [41]:
df.mean()

std_id             15.500000
math_score         62.366667
science_score      64.466667
english_score      70.266667
bio_score          67.600000
physics_score      61.033333
chemistry_score    69.000000
dtype: float64

In [42]:
math_score_mean=mean(df['math_score'])
math_score_mean

62.36666666666667

In [43]:
df['english_score'].describe()

count    30.000000
mean     70.266667
std      20.006780
min      36.000000
25%      53.000000
50%      71.000000
75%      88.750000
max      99.000000
Name: english_score, dtype: float64

In [44]:
df['english_score'].mean()

np.float64(70.26666666666667)

In [47]:
df.columns

Index(['std_id', 'math_score', 'science_score', 'english_score', 'bio_score',
       'physics_score', 'chemistry_score'],
      dtype='object')

In [51]:
df=pd.read_csv('Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [52]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [53]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [55]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [56]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [57]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [58]:
df['Pclass'].unique()

array([3, 1, 2])

In [59]:
df.shape

(891, 12)

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [62]:
df.describe(include='O')

                       Name   Sex  Ticket Cabin Embarked
count                   891   891     891   204      889
unique                  891     2     681   147        3
top     Dooley, Mr. Patrick  male  347082    G6        S
freq                      1   577       7     4      644

In [63]:
df.loc[df['Age']==80]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [66]:
df.loc[(df['Sex']=='male') & (df['Age']>40)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
...,...,...,...,...,...,...,...,...,...,...,...,...
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
860,861,0,3,"Hansen, Mr. Claus Peter",male,41.0,2,0,350026,14.1083,NaN,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S

In [68]:
#no. of female in first class
df.loc[(df['Sex']=='female') & (df['Pclass']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
...,...,...,...,...,...,...,...,...,...,...,...,...
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [72]:
#number of female that survived the titanic crash in first class
df.loc[(df['Sex']=='female')& (df['Pclass']==1)&(df['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
...,...,...,...,...,...,...,...,...,...,...,...,...
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [73]:
df.iloc[np.where(df['Age']==80)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [75]:
import pandas as pd

df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35]
})

# Get the first row
print(df.iloc[0])

# Get the value in 1st row, 2nd column
print(df.iloc[0, 1])  # Output: 25

# Get the first two rows
print(df.iloc[:2])

name    Alice
age        25
Name: 0, dtype: object
25
    name  age
0  Alice   25
1    Bob   30

In [76]:
# Set 'name' as the index
df = df.set_index('name')

# Get the row for 'Bob'
print(df.loc['Bob'])

# Get the value for 'Charlie', column 'age'
print(df.loc['Charlie', 'age'])  # Output: 35

# Get multiple rows
print(df.loc[['Alice', 'Bob']])

age    30
Name: Bob, dtype: int64
35
       age
name
Alice   25
Bob     30